# task 01 == Виправте синтаксичні помилки
#Тут были лишние пробелы потому что print - это не оператор
print("Hello", end = " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
#А тут не хватает пробелов потому что это оператор
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter) #тут letter забыли

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples*4

# task 05 == виправте назви змінних
_storona = 1 #нельзя использовать вначале названий переменных цифры
torona_2 = 2 #нельзя использовать спецсимволы
сторона_3 = 3 #как бы ошибки нет, но лучше называть переменные латиницей
torona_4 = 4 #нельзя использовать спецсимволы

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = _storona + torona_2 + сторона_3 + torona_4
print("P=",perimetery)


"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""
apples = 4
pears = apples + 5
plums = apples - 2
garden = apples+pears+plums
print("Яблок=", apples)
print("Груш=", pears)
print("Слив=", plums)
print("В саду посадили",garden,"деревьев")

# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""
obed = 5
posleobed = obed - 10
vecher = posleobed + 4
print("Температура до обеда=",obed)
print("Температура после обеда=",posleobed)
print("Температура вечером",vecher,"C")

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""
boys=24
girls = boys /2
losses_boys = 1
losses_girls = 2
theater = boys - losses_boys + girls - losses_girls
print("Всего мальчиков:",boys)
print("Всего девочек:",int(girls))
print("Не пришло детей:",losses_girls+losses_boys)
print("Сегодня пришло аж:",int(theater),"ребенка")
# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
book_1= 8
book_2 = book_1 + 2
book_3 = (book_1 + book_2) /2

print("Первая книга:",book_1,"грн")
print("Вторая книга:",book_2,"грн")
print("Третья книга:",int(book_3),"грн")
print("Стоимость всех книг:",book_1+book_2+int(book_3),"грн")