print("Задание:"
      " Порахувати кількість унікальних символів в строці. Якщо їх більше 10 - вивести в консоль True, інакше - False. "
      "Строку отримати за допомогою функції input()")
text = input("Введите ваш очень уникальный текст: ")
unique_chars = set(text) # что-то из 5 урока :)
count_unique = len(unique_chars) #пробел тоже символ, так что с ним не церемонюсь и считаю

if count_unique > 10:
    print(f"В вашем тексте больше 10 уникальных символов - {True}")
else:
    print(f"В вашем не очень уникальном тексте больше 10 уникальных символов - {False}")

