print("""Задание:Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є літера "h" (враховуються як великі так і маленькі). 
Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".""")
print("-"*60) # вспомнил что вы так делали, так намного проще чем рисовать самому)
attempts = 0
while True: #while сразу всплыл из памяти когда запахло бесконечным циклом
    word = input('Введите слово с буквой "h": ')
    attempts += 1
    if 'h' in word.lower():
        print(f'''Невероятно! Просто безумие! Слово "{word}" содержит букву "H/h"''')
        print(f'Вы сдались всего на какой-то: {attempts} раз')
        break